app/Livewire/Home.php

    public function mount()
    {
        $this->workshops = Workshop::all();
        $this->texts = Text::all();
        $this->posts = Post::all();
        $this->awards = Award::with('product')->latest()->limit(4)->get();
        $this->product = Product::find('product_id');
        $this->category = Category::all();
        $this->allProduct = Product::with('categories')->inRandomOrder()->limit(6)->get();
        $this->categories= Category::find('idDM');
---
select * from `workshops`
select * from `texts`
select * from `posts`
select * from `awards` order by `created_at` desc limit 4
select * from `products` where `products`.`id` in (1, 2, 3, 4)
select * from `products` where `products`.`id` = 'product_id' limit 1
select * from `categories`
select * from `categories` where `categories`.`id` in (4, 5, 6, 8, 9)
select * from `products` order by RAND() limit 6
select * from `categories` where `categories`.`id` = 'idDM' limit 1