app/Livewire/Login.php

select * from `users` where `email` = 'dieuleen1211@gmail.com' limit 1
---
    public function handleGoogleCallback(){
        try {

            $user = Socialite::driver('google')->user();

            $finduser = User::where('email', $user->email)->first();