app/Livewire/Posts.php

select * from `posts` where `title` like '%drone%' order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `posts` where `title` like '%drone%'
---
    public function render()
    {
        $posts = Post::query()
            ->where('title', 'like', '%' . $this->search . '%')
            ->orderBy('created_at', 'desc')
            ->paginate(9);