app/Livewire/Products.php

select * from `categories`
---
    public function render()
    {
         $categories = Category::all();

         $products = Product::query();

         if ($this->search) {
            $products->where('name', 'like', '%' . $this->search . '%');
        }

         if ($this->selectedCategory) {

select * from `categories` where `categories`.`id` in (2, 3, 4, 5, 6, 8, 10)
---
            $products->orderBy('created_at', 'desc');
        }

         $allProduct = $products->with('categories')->paginate(9);