app/Livewire/Workshops.php

    public function render()
    {
         $workshopsQuery = Workshop::query();

         if ($this->search) {
            $workshopsQuery->where('title', 'like', '%' . $this->search . '%');
        }

         $workshops = $workshopsQuery->orderBy('start_time', 'desc')->paginate(9);
---
select * from `workshops` order by `start_time` desc limit 9 offset 0
select count(*) as aggregate from `workshops`